app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT `ideas`.* FROM `ideas`