app/controllers/movies_users_controller.rb

SELECT COUNT(*) FROM `movies`  WHERE `movies`.`api_id` = 216015
INSERT INTO `movies` (`api_id`, `created_at`, `description`, `title`, `updated_at`, `url_cover`) VALUES (201088, '2015-02-12 13:45:03', 'Hacker suit un détenu en permission et ses associés américains et chinois dans leurs efforts pour traquer et démanteler un puissant réseau de cybercriminalité internationale, les entraînant de Chicago et Los Angeles à Hong Kong et Jakarta.', 'Hacker', '2015-02-12 13:45:03', '/dmO7eW0gqXccKdNlRJRCLw31bip.jpg')
---
	def add_watch
		# Récupération des ID de l'user connecté et de la movie ainsi que l'état "À voir" ou "Vu"
		id_user = params[:user_id]
		id_movie = params[:movie_id]
		etat = params[:etat] # Dans la base de donnée, état 1 : Vu - état 2 : À voir


		# ***************************** #
		# 	1.1 Ajout du film dans la table movies
		#
		# ***************************** #
		movie = Movie.where(:api_id => id_movie) # Vérifie si le film n'existe pas déjà en BDD

		if movie.empty?
			# Récupère les données du film dans l'API
			detail_movie = Tmdb::Movie.detail(id_movie)

			# Enregistre le film dans la table movies
			movie = Movie.new(
				:title => detail_movie.title,
				:description => detail_movie.overview,
				:url_cover => detail_movie.poster_path,
				:api_id => id_movie
			)

			movie.save

SELECT  `movies_users`.* FROM `movies_users`  WHERE `movies_users`.`user_id` = 2 AND `movies_users`.`movie_id` = 76757  ORDER BY `movies_users`.`id` ASC LIMIT 1
SELECT `movies_users`.* FROM `movies_users`  WHERE `movies_users`.`user_id` = 2 AND `movies_users`.`movie_id` = 76757 AND `movies_users`.`etat` = 1
---
		#
		# ***************************** #
		# Vérifie si le film n'est pas déjà lié à l'utilisateur courant dans la table movies_users
		user_movie = current_user.movies_users.where(:movie_id => id_movie).first

		# Même vérification qu'au dessus + si l'état du film correspond à l'état qu'on lui demande d'avoir
		# Afin d'éviter des doublons
		user_movie_etat = current_user.movies_users.where(:movie_id => id_movie, :etat => etat)

SELECT `movies_users`.* FROM `movies_users`  WHERE `movies_users`.`user_id` = 1 AND `movies_users`.`etat` = 1  ORDER BY etat ASC
SELECT  `movies_users`.* FROM `movies_users`  WHERE `movies_users`.`user_id` = 1 AND `movies_users`.`movie_id` = 2  ORDER BY `movies_users`.`id` ASC LIMIT 1
SELECT  `movies`.* FROM `movies`  WHERE `movies`.`api_id` = 260346  ORDER BY `movies`.`id` ASC LIMIT 1
---
	def movies_list
		# Liste des films liés à l'utilisateur courant (table movies_users)
		# Order by À voir puis Vu
		@movies_users = current_user.movies_users.order("etat DESC")

		# Liste des films
		@movies = Array.new

		@movies_users.each do |movie|
			if movie

				# Récupère la liste des films dans la table movies
				@movies.push(Movie.where(:api_id => movie['movie_id']).first)