app/controllers/movies_controller.rb

	def home

		#@new_trailers = Array.new
		@movies = Tmdb::Movie.now_playing

		@movieStatus = Tmdb::Movie.detail(params[:id])

		#movies.each do |movie|
			#@img = Tmdb::Movie.detail(movie.name)
			#@new_trailers.push(@img)
		#end

		movie = Movie.where(:title => "anais")
		if movie.empty?
---
SELECT COUNT(*) FROM `movies`  WHERE `movies`.`title` = 'anais'